![copernicani](https://copernicani.it/wp-content/uploads/cropped-logo_orizzontale_trasparente-1-e1525161268864.png)


g0v mef ontology
==============

The Italian budget is a set of  living financial documents defined by the Italian Government according a [well defined process](https://openbdap.mef.gov.it/it/Home/LaManovra).

Raw data about the Italian budget are published regularly in the [BDAP Open Data Catalog](https://bdap-opendata.mef.gov.it/catalog) by the [Ragioneria Generale dello Stato](http://www.rgs.mef.gov.it/), on behalf of the [Ministero dell'Economia e delle Finanze](http://www.mef.gov.it/) (MEF).

The *g0v mef ontology* is an open conceptual model developed by the [g0v.it civic hacking team](https://g0v.it)
using the Web Ontology Language (OWL). As such it is not only a
data model but a representation of the “things in the world” of MEF. 

**What is an ontology?**

An ontology in OWL is made up of statements about Classes (i.e. sets of things) and Properties (ways that things relate to other things). *g0v mef ontology*  defines the sets of things that are of interest in describing the Italian Budget, and the ways that those things can relate to one another. 
In this way, *g0v mef ontology* can give meaning to any data (e.g., spreadsheets, relational databases, XML documents) that describe the Italian budget. 

RDF and OWL are World Wide Web Consortium (W3C) standards.

![Ontology Spectrumm](fig1.jpg)


## Accessing g0v mef ontology

*g0v mef ontology* is technically expressed in the RDF/OWL - the language of the World Wide Web for machine readable inference processing. 
It is very expressive and linguistically aligned with how people think and speak - but expressed in a way that machines can process 
based on mathematical formulas and description logic. By taking advantage of the RDF/OWL Web standard, *g0v mef ontology* uses machine 
intelligence and network graph capabilities to express, classify and link data in ways that were not previously possible.

The RDF/OWL source [is available in a file](mef.rdf) serialized using XML RDF notation. 
The RDF/OWL file can be embedded in
computer applications that can perform logic functions such as inferring classifications and relationships.

You can also access this ontology with these tools::
 
- navigate the *g0v mef ontology* with [WebOwl](http://visualdataweb.de/webvowl/#iri=http://w3id.org/g0v/it/mef)
- read the html document generated by [LODE](http://150.146.207.114/lode/extract?url=http://w3id.org/g0v/it/mef)
- edit *g0v mef ontology* with [Standford University Protégeè](https://protege.stanford.edu/)



## Italian budget life cycle

The Italian budget exists in three main states that evolve by releases:

-  *Disegno di Legge di Bilancio*: published yearly by the Italian government (usually at the beginning of November) and presented to the Italian Parliament and to the EU commission for approval.
- *Legge di Bilancio*: approved by the Italian Parliament usually before the end of the year
- *Rendiconto*: approved by the Italian Parliament as a consolidated view of the budget data

In each state more than one version can be published.
To capture this life cycle, mef vocabulary adheres to [Semantic Versioning](http://semver.org/) with some additional constraints:

- MAJOR version number refers to the reference year of the financial document,
- MINOR version number refers to the main budget state: 
    - **0** means *Disegno di Legge di Bilancio*, 
    - **1** means *Legge di Bilancio*, 
    - **2** means *Rendiconto*
- PATCH version number refers to a document release (0 is the first release) 

e.g.:

- *2020.0.0* means the first release of *Disegno di Legge di Bilancio* relative to 2020 year as published in Nov. 2019)
- *2019.1.0* means the first release of *Legge di Bilancio* relative to 2019 year as approved by the Italian Parliament ( in Dec. 2018)
- *2018.2.0* means first release of *Rendiconto* relative to 2018 year as approved by the Italian Parliament (in 2019)

 
## The mef vocabulary

The mef Vocabulary extends the [Financial Report](http://linkeddata.center/botk-fr/v1) and [SKOS](http://www.w3.org/2004/02/skos/core) vocabularies.

The namespace for *g0v mef ontology* is *http://w3id.org/g0v/it/mef#* and the suggested prefix is *mef:*

![UML diagram](uml-diagram.png)

### Mapping the Financial Report ontology

- **mef:StructuralComponents** is an extension of fr:StructuralComponents that exports three distinct metrics as sub-properties of fr:amount
- a **mef:Budget** is an extension of fr:FinancialReport exposing mef:budgetVersion a sub-properties of fr:versionId. 
- the *mef:competenza* property is to be considered a sub-property of *fr:amount*
- *mef:cassa* and *mef:residui are two additional metrics that share the same value propagation behaviour of the *fr:amount* property

### Mapping SKOS

- **mef:StructuralComponent** is a skos:Concept
- **mef:Budget** is a skos:ConceptScheme
- **fr:dataSet** should be considered as a sub-property of skos:inScheme
- **fr:isPartOf** should be considered as a sub-property of skos:broaderTransitive 
- **mef:StructuralComponents** in different **mef:Budget** with the same skos:notation should be considered related with skos:closeConcept properties
- a **mef:StructuralComponents** can be skos:inScheme of one or more taxonomies exposed by **mef:Budget** 

#### Taxonomies

Every budget is a taxonomy that includes a set of budget taxonomies. The budget top level Concepts are the administrations (i.e. Ministeri).
A budget taxonomy is identified by a letter (ie. mef:budgetTaxonomyId)

The budget taxonomy always includes:

- the administration taxonomy (A)
- taxonomies related to expenses, all including (A):
    - U: **Capitolo di spesa->Piano di gestione**
    - M: **Missione->Programma->Azione**, includes(U)
    - R: **Centro di responsabilità**, includes(M)
    - T: **Titolo spesa->Categoria**, includes(U)
- taxonomies related to incomings all including (A):	
    - E: **Capitolo entrata->Articolo** (E)
    - N: **Titolo entrata->Natura->Tipologia**, includes(E)
    - S: **Titolo entrata->Tipologia->Provento**, includes(E)

### Axioms

Axioms are expressed as SPARQL update constructs:

**The value of the component metrics is computed as the sum of the related facts**

```sparql-query
CONSTRUCT { 
	?component 
		mef:competenza ?competenzaSum ;
		mef:cassa ?cassaSum ;
		mef:residui ?residuiSum
}
WHERE {
	SELECT ?component (SUM(?competenza) AS ?competenzaSum) (SUM(?cassa) AS ?cassaSum) (SUM(?residui) AS ?residuiSum) WHERE {
		?fact a mef:Fact ;  
			fr:isPartOf+ ?component  ;
			mef:competenza ?competenza;
			mef:cassa ?cassa ;
			mef:residui ?residui; 
	} GROUP BY ?component
}	
```

**A mef:Budget includes all facts and components taxonomies**

```sparql-query
CONSTRUCT { 
	?budget owl:includes ?taxonomy .
}
WHERE {
	?component a mef:StructuralComponent ;
		qb:dataSet ?budget
		skos:inScheme ?taxonomy ;
	?taxonomy a mef:BudgetTaxonomy ;
}	
```

**All taxonomies include budget amministrazioni taxonomy**

```sparql-query
CONSTRUCT { 
	?taxonomy owl:includes ?administrations .
}
WHERE {
	?budget a mef:Budget; 
		mef:includesAdministrations ?administrations;
		owl:includes ?taxonomy.
	FILTER( ?taxonomy != ?administrations)
}	
```


**mef:StructuralComponent history inference:**

```sparql
CONSTRUCT { 
	?oldFactOrComponent dct:hasVersion ?newFactOrComponent .	
	?newFactOrComponent dct:isVersionOf ?oldFactOrComponent .
}
WHERE {
	?newFactOrComponent a mef:StructuralComponent ;
		skos:notation ?notation ;
		qb:dataSet/fr:referenceDate ?newDate .
	
	?oldFactOrComponent a mef:StructuralComponent ;
		skos:notation ?notation ;
		qb:dataSet/fr:referenceDate ?oldDate .
	FILTER ( ?oldFactOrComponent !=  ?newFactOrComponent )
	FILTER ( ?oldDate < ?newDate )
}	
```

### Datatypes

Following String datatype are defined:


| datatype              | regexp                        | usage                                               |
|-----------------------|-------------------------------|-----------------------------------------------------|
| mef:SemanticVersion   | `^20\d{2}\.[0-2]\.\d+$`       | for  mef:Budget fr:versionId  (e.g. 2019.1.2)       |
| mef:Notation          | `^[A-Z]?[1-9]?\d*(-\d+)*$`    | for skos:notation of concepts in mef:BudgetTaxonomy |

Notation Strings can be used to encode information that are parsable with specific regular expressions. E.g:

- `^A([1-9])\d?$` e.g. *A12*: a ministero with code 12
- `^M([1-9]\d?)-(\d+)-(\d+)$` e.g. *M1-2-3*: a  programma with code "3" in the "missione" "2" in the Administration "A1";
- `^([URMTES])$` e.g. *M*: the taxonomy "Missione->Programma->Azione"
- `^B(20\d{2})(\d)(\d)$` *B201912*: a budget with versionId "2019.1.2", that is the third version of the "Legge di Bilancio" financial report for 2019 year 

